# SHOW DATABASES-

In [13]:
import mysql.connector as connection
mydb=connection.connect(host="localhost",user="root",passwd="mysql",use_pure=True)
mycursor=mydb.cursor()
mycursor.execute("SHOW DATABASES")

In [9]:
l=[]
for i in mycursor:
    l.append(i)
print(l)

[('information_schema',), ('jswvssut',), ('kid',), ('mysql',), ('performance_schema',), ('sakila',), ('sarthak',), ('saturday',), ('sunday',), ('sys',), ('test1',), ('tuesday',), ('wedeve',), ('wednesday',), ('world',)]

In [10]:
import pandas as pd
pd.read_sql("SHOW DATABASES",mydb) #showing list od databses in neat tabular format through pandas dataframe object.

              Database
0   information_schema
1             jswvssut
2                  kid
3                mysql
4   performance_schema
5               sakila
6              sarthak
7             saturday
8               sunday
9                  sys
10               test1
11             tuesday
12              wedeve
13           wednesday
14               world

In [16]:
mydb=connection.connect(host="localhost",database="SATURDAY",user="root",passwd="mysql",use_pure=True)
mycursor=mydb.cursor()
mycursor.execute("SHOW DATABASES")
mycursor.fetchall()
mydb.close()

# CREATE TABLE-

In [17]:
mydb=connection.connect(host="localhost",user="root",passwd="mysql",database="SUNDAY",use_pure=True)

In [7]:
mydb.is_connected()

True

In [19]:
mycursor=mydb.cursor()

In [20]:
mycursor.execute("CREATE TABLE SUNDAY.N1 (C1 INT(20),C2 VARCHAR(50),C3 DATE)")

In [21]:
mycursor.execute("SHOW TABLES") #as default database is already passed in connection object,show tables command is working here

In [22]:
for i in mycursor:   #TABLE IS CREATED.
    print(i)

('m1',)
('n',)
('n1',)

In [23]:
pd.read_sql("SHOW TABLES",mydb) #In mydb connection object the default databse is selected hence this query is getting fired through

  Tables_in_sunday
0               m1
1                n
2               n1

Primary Key-
When creating a table, you should also create a column with a unique key for each record.

This can be done by defining a PRIMARY KEY. It doesnt allow duplicate entries for that particular column.
auto increment primary key sets id of the entire record as the entry inserted in that column. equivalent to immutable _id field in mongo.

We use the statement "INT AUTO_INCREMENT PRIMARY KEY" which will insert a unique number for each record. Starting at 1, and increased by one for each record.

In [16]:
#if table already exists we can use alter keyword to add a column-

In [22]:
try:    
    mycursor.execute("ALTER TABLE SUNDAY.n1 ADD COLUMN C5 INT AUTO_INCREMENT PRIMARY KEY")
except Exception as e:
    print(str(e)) #we can set only one auto column an dit must be defined as a key.

1075 (42000): Incorrect table definition; there can be only one auto column and it must be defined as a key

In [24]:
mycursor=mydb.cursor()
mycursor.execute("ALTER TABLE SUNDAY.N1 ADD COLUMN C4 INT AUTO_InCREMENT PRIMARY KEY")

# INSERT DATA-

In [1]:
import mysql.connector as connection
mydb=connection.connect(host="localhost",user="root",passwd="mysql",database="sunday",use_pure=True)
mycursor=mydb.cursor()

In [28]:
mycursor=mydb.cursor()

In [14]:
sql="INSERT INTO SUNDAY.N1(C1,C2,C3,C4) VALUES(%s,%s,%s,%s)" #%s used to encrypt the data to be entered which can be passed in tuple.

In [15]:
val=(2,"MANISHA","1996-04-14","58") #AUTO INCREMENT PRIMARY KEY ENSURES NO DUPLICATE ENTIRES ARE FIRED FOR THAT PARTICULAR COLUMN

In [16]:
mycursor.execute(sql,val)
mydb.commit()

In [49]:
mydb.commit()

In [20]:
mycursor.execute("insert into sunday.m1 (C1,C2,C3,C4) values (1,'SART','1995-05-21',589)") #another way of inserting data.

In [21]:
mydb.commit() #It is required to make the changes, otherwise no changes are made to the table.

In [57]:
#INSERTING MULTIPLE QUERIES-

In [36]:
query="INSERT INTO SUNDAY.N1(C1,C2,C3,C4) VALUES(%s,%s,%s,%s)"

In [39]:
lst=[("1","STWR","1993-05-12","6374"),("23","SHRHLS","1990-02-12","726")]

In [40]:
mycursor.executemany(query,lst)

In [41]:
mydb.commit()

In [42]:
mycursor.lastrowid

726

In [43]:
mycursor=mydb.cursor()
query="INSERT INTO SUNDAY.N1 (C1,C2,C3,C4) VALUES(%s,%s,%s,%s)"
lst=[("123","MANISHGA","1992-04-12","1234"),("1232","SARTHAK","1992-03-12","485858")]
mycursor.executemany(query,lst)
mydb.commit()

# SELECT  FROM-

In [56]:
mydb=connection.connect(host="localhost",user="root",database="sunday",passwd="mysql",use_pure=True)
cursor=mydb.cursor()
cursor.execute("select * from SUNDAY.N1")
cursor.fetchall()

[(1, 'MANISHA', datetime.date(1996, 4, 14), 55),
 (2, 'MANISHA', datetime.date(1996, 4, 14), 58),
 (1, 'STWR', datetime.date(1993, 5, 12), 637),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 726),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 736),
 (123, 'MANISHGA', datetime.date(1992, 4, 12), 1234),
 (1, 'STWR', datetime.date(1993, 5, 12), 6374),
 (1232, 'SARTHAK', datetime.date(1992, 3, 12), 485858)]

In [50]:
mycursor.execute("select * from SUNDAY.N1")

In [51]:
mycursor.fetchall()

(1, 'MANISHA', datetime.date(1996, 4, 14), 55)

In [73]:
a=pd.read_sql("select * from SUNDAY.M1",mydb) #arranging tabular data in neat format.

In [74]:
a.to_csv("DATAS.csv")

In [59]:
import pandas as pd
pd.read_csv("DATAS.csv") #reading data after manipulating it in csv file.
import csv

In [60]:
f=open("DATAS.csv","r") #dumping data in bulk back to the sql table from csv file.
next(f)
dat=csv.reader(f,delimiter=",")
for i in dat:
    print(i)
    l=[]
    for j in i[1:len(i)]:
        l.append(j)
    mycursor=mydb.cursor()
    query="insert into sunday.m1(C1,C2,C3,C4)values(%s,%s,%s,%s)"
    mycursor.execute(query,tuple(l))
    mydb.commit()
print("ALL VALUES DUMPED BACK TO TABLE") #all bulk data fro csv file getting imported to sql.

['0', '1', 'MANISHA', '1996-04-14', '4298']
['1', '1', 'MANISHA', '1996-04-14', '4546']
['2', '1', 'SARTHAK', '1996-04-14', '45656']

IntegrityError: 1062 (23000): Duplicate entry '45656' for key 'm1.PRIMARY'

In [91]:
i[1:len(i)]
l1=[]

In [92]:
for j in i[1:len(i)]:
    l1.append(j)

In [96]:
t

(['0', '1', 'MANISHA', '1996-04-14', '42'],
 ['0', '1', 'MANISHA', '1996-04-14', '42'],
 ['0', '1', 'MANISHA', '1996-04-14', '42'],
 ['0', '1', 'MANISHA', '1996-04-14', '42'])

In [94]:
tuple(l1)

('1', 'MANISHA', '1996-04-14', '42')

In [101]:
#Projecting selected columns to be diplayed-

In [102]:
mycursor=mydb.cursor()
mycursor.execute("select C1,C3,C4 from SUNDAY.m1")
mycursor.fetchall()

[(1, datetime.date(1996, 4, 14), 42),
 (1, datetime.date(1996, 4, 14), 43),
 (1, datetime.date(1996, 4, 14), 44),
 (1, datetime.date(1996, 4, 14), 45),
 (1, datetime.date(1996, 4, 14), 55),
 (1, datetime.date(1995, 5, 21), 57),
 (1, datetime.date(1995, 5, 21), 59),
 (1, datetime.date(1993, 5, 12), 63),
 (1, datetime.date(1993, 5, 12), 67),
 (23, datetime.date(1990, 2, 12), 70),
 (23, datetime.date(1990, 2, 12), 73),
 (1, datetime.date(1996, 4, 14), 454),
 (1, datetime.date(1996, 4, 14), 456),
 (1, datetime.date(1996, 4, 14), 557),
 (1, datetime.date(1995, 5, 21), 576),
 (1, datetime.date(1995, 5, 21), 598),
 (1, datetime.date(1993, 5, 12), 636),
 (1, datetime.date(1993, 5, 12), 675),
 (23, datetime.date(1990, 2, 12), 701),
 (23, datetime.date(1990, 2, 12), 732),
 (1, datetime.date(1996, 4, 14), 4298),
 (1, datetime.date(1996, 4, 14), 4546),
 (1, datetime.date(1996, 4, 14), 45656),
 (23, datetime.date(1990, 2, 12), 73254),
 (1, datetime.date(1995, 5, 21), 576445),
 (1, datetime.date(1996, 4, 14), 5573543),
 (1, datetime.date(1995, 5, 21), 5983344),
 (1, datetime.date(1993, 5, 12), 6754545),
 (23, datetime.date(1990, 2, 12), 7014444),
 (1, datetime.date(1993, 5, 12), 636345544)]

# WHERE IN SQL-

In [7]:
import mysql.connector as connection
mydb=connection.connect(host="localhost",user='root',passwd="mysql",database="SUNDAY",use_pure=True)
mycursor=mydb.cursor()

In [8]:
mycursor.execute("select * from sunday.m1 where C2='SARTHAK'")

In [9]:
mycursor.fetchall()

[(1, 'SARTHAK', datetime.date(1996, 4, 14), 45),
 (1, 'SARTHAK', datetime.date(1996, 4, 14), 456),
 (1, 'SARTHAK', datetime.date(1996, 4, 14), 45656)]

In [10]:
mycursor.execute("select * from sunday.m1 where C2 in ('SARTHAK','MANISHA')")

In [11]:
mycursor.fetchall()

[(1, 'MANISHA', datetime.date(1996, 4, 14), 42),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 43),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 44),
 (1, 'SARTHAK', datetime.date(1996, 4, 14), 45),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 55),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 454),
 (1, 'SARTHAK', datetime.date(1996, 4, 14), 456),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 557),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 4298),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 4546),
 (1, 'SARTHAK', datetime.date(1996, 4, 14), 45656),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 5573543)]

In [12]:
mycursor.execute("select * from sunday.m1 where C2 in ('SARTHAK','MANISHA') or c3='1996-04-14'")

In [13]:
mycursor.fetchall()

[(1, 'MANISHA', datetime.date(1996, 4, 14), 42),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 43),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 44),
 (1, 'SARTHAK', datetime.date(1996, 4, 14), 45),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 55),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 454),
 (1, 'SARTHAK', datetime.date(1996, 4, 14), 456),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 557),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 4298),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 4546),
 (1, 'SARTHAK', datetime.date(1996, 4, 14), 45656),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 5573543)]

Wildcard Characters
You can also select the records that starts, includes, or ends with a given letter or phrase.

Use the %  to represent wildcard characters:

In [62]:
mycursor=mydb.cursor()
mycursor.execute("select * from sunday.m1 where C2 like '%SH%'") # can be used for regex characters.
mycursor.fetchall()  #'%sh%' means to check whether %sh% exists in string.

[(23, 'SHRHLS', datetime.date(1990, 2, 12), 70),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 73),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 701),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 732),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 4298),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 4546),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 73254),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 7014444)]

In [66]:
cursor=mydb.cursor()
cursor.execute("select * from sunday.n1 where C2 like '%SA%'")
cursor.fetchall()

[(1232, 'SARTHAK', datetime.date(1992, 3, 12), 485858)]

Prevent SQL Injection
When query values are provided by the user, you should encrypt the values with the help of a placeholder and passing values in immutable tuples.

This is to prevent SQL injections, which is a common web hacking technique to destroy or misuse your database.

In [74]:
mycursor=mydb.cursor()
query="select * from sunday.m1 where C2=%s"
t=("MANISHA",) #passing values in tuples so that they cant be manipulated externally.
mycursor.execute(query,t)

InternalError: Unread result found

In [82]:
mydb=connection.connect(host="localhost",user="root",database="sunday",passwd="mysql",use_pure=True)
cursor=mydb.cursor()
query= "select * from sunday.n1 where C2=%s" #encrypting data in queries where encrypted data is passed in tuples
t=("MANISHA",)
cursor.execute(query,t)
cursor.fetchall()

[(1, 'MANISHA', datetime.date(1996, 4, 14), 55),
 (2, 'MANISHA', datetime.date(1996, 4, 14), 58)]

# ORDER BY-

Use the ORDER BY statement to sort the result in ascending or descending order.

The ORDER BY keyword sorts the result ascending by default. To sort the result in descending order, use the DESC keyword.

In [92]:
mydb=connection.connect(host="localhost",user="root",passwd="mysql",database="sunday",use_pure=True)
mycursor=mydb.cursor()

In [93]:
mycursor.execute("select C1,C2 from sunday.n1 order by C1") #default order by ascending

In [94]:
mycursor.fetchall()

[(1, 'MANISHA'),
 (1, 'STWR'),
 (1, 'STWR'),
 (2, 'MANISHA'),
 (23, 'SHRHLS'),
 (23, 'SHRHLS'),
 (123, 'MANISHGA'),
 (1232, 'SARTHAK')]

In [35]:
mycursor.execute("select * from sunday.m1 order by c1")  #fetches queries by sorting it in ascending order by defualt.

In [36]:
mycursor.fetchall()

[(1, 'MANISHA', datetime.date(1996, 4, 14), 42),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 43),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 44),
 (1, 'SARTHAK', datetime.date(1996, 4, 14), 45),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 55),
 (1, 'SART', datetime.date(1995, 5, 21), 57),
 (1, 'SART', datetime.date(1995, 5, 21), 59),
 (1, 'STWR', datetime.date(1993, 5, 12), 63),
 (1, 'STWR', datetime.date(1993, 5, 12), 67),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 454),
 (1, 'SARTHAK', datetime.date(1996, 4, 14), 456),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 557),
 (1, 'SART', datetime.date(1995, 5, 21), 576),
 (1, 'SART', datetime.date(1995, 5, 21), 598),
 (1, 'STWR', datetime.date(1993, 5, 12), 636),
 (1, 'STWR', datetime.date(1993, 5, 12), 675),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 4298),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 4546),
 (1, 'SARTHAK', datetime.date(1996, 4, 14), 45656),
 (1, 'SART', datetime.date(1995, 5, 21), 576445),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 5573543),
 (1, 'SART', datetime.date(1995, 5, 21), 5983344),
 (1, 'STWR', datetime.date(1993, 5, 12), 6754545),
 (1, 'STWR', datetime.date(1993, 5, 12), 636345544),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 70),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 73),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 701),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 732),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 73254),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 7014444)]

In [37]:
#fetching queries by sorting in descending order-

In [95]:
mycursor=mydb.cursor()
mycursor.execute("select * from sunday.n1 order by C1 desc")
mycursor.fetchall()

[(1232, 'SARTHAK', datetime.date(1992, 3, 12), 485858),
 (123, 'MANISHGA', datetime.date(1992, 4, 12), 1234),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 726),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 736),
 (2, 'MANISHA', datetime.date(1996, 4, 14), 58),
 (1, 'MANISHA', datetime.date(1996, 4, 14), 55),
 (1, 'STWR', datetime.date(1993, 5, 12), 637),
 (1, 'STWR', datetime.date(1993, 5, 12), 6374)]

# DELETE FROM-

In [99]:
mycursor=mydb.cursor()
q="delete from SUNDAY.N1 where c2=%s"
t=('MANISHA',)
mycursor.execute(q,t)

In [100]:
mycursor=mydb.cursor()
query='delete from sunday.n1 where C2=%s'
t=("MANISHA",)
mycursor.execute(query,t)
mydb.commit()

In [42]:
mycursor=mydb.cursor()
mycursor.execute("select * from sunday.m1")

In [43]:
mycursor.fetchall()

[(1, 'SARTHAK', datetime.date(1996, 4, 14), 45),
 (1, 'SART', datetime.date(1995, 5, 21), 57),
 (1, 'SART', datetime.date(1995, 5, 21), 59),
 (1, 'STWR', datetime.date(1993, 5, 12), 63),
 (1, 'STWR', datetime.date(1993, 5, 12), 67),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 70),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 73),
 (1, 'SARTHAK', datetime.date(1996, 4, 14), 456),
 (1, 'SART', datetime.date(1995, 5, 21), 576),
 (1, 'SART', datetime.date(1995, 5, 21), 598),
 (1, 'STWR', datetime.date(1993, 5, 12), 636),
 (1, 'STWR', datetime.date(1993, 5, 12), 675),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 701),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 732),
 (1, 'SARTHAK', datetime.date(1996, 4, 14), 45656),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 73254),
 (1, 'SART', datetime.date(1995, 5, 21), 576445),
 (1, 'SART', datetime.date(1995, 5, 21), 5983344),
 (1, 'STWR', datetime.date(1993, 5, 12), 6754545),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 7014444),
 (1, 'STWR', datetime.date(1993, 5, 12), 636345544)]

# DROP TABLE-

In [101]:
mycursor=mydb.cursor()
mycursor.execute("drop table if exists sunday.m1")

In [102]:
mycursor=mydb.cursor()
mycursor.execute("SHOW TABLES")
mycursor.fetchall()

[('n',), ('n1',)]

In [46]:
#dropping table if it exists-

In [48]:
mycursor=mydb.cursor()
mycursor.execute("drop table if exists sunday.m ")

# UPDATE TABLE-

In [112]:
mycursor=mydb.cursor()

In [108]:
mycursor.execute("update SUNDAY.N1 set C2='SARTHAK'where C4=637")

In [115]:
mydb.commit()

In [111]:
#UPDATING TABLE BY ENCRYPTING VALUES-

In [114]:
query="update SUNDAY.N1 set C2=%s where C4=%s"
t=("SARTHAK","726")
mycursor.execute(query,t)

# LIMIT TABLE-

Limit the Result
You can limit the number of records returned from the query, by using the "LIMIT" statement:

In [116]:
mycursor=mydb.cursor()

In [119]:
mycursor.execute("SELECT * FROM SUNDAY.N1 LIMIT 3")

In [120]:
mycursor.fetchall()

[(1, 'SARTHAK', datetime.date(1993, 5, 12), 637),
 (23, 'SARTHAK', datetime.date(1990, 2, 12), 726),
 (23, 'SHRHLS', datetime.date(1990, 2, 12), 736)]

Start From Another Position
If you want to return five records, starting from the third record, you can use the "OFFSET" keyword:

In [121]:
mycursor=mydb.cursor()

In [123]:
mycursor.execute("SELECT * FROM SUNDAY.N1 LIMIT 3 OFFSET 2")

In [124]:
mycursor.fetchall()

[(23, 'SHRHLS', datetime.date(1990, 2, 12), 736),
 (123, 'MANISHGA', datetime.date(1992, 4, 12), 1234),
 (1, 'STWR', datetime.date(1993, 5, 12), 6374)]

# MYSQL JOIN-

In [3]:
import mysql.connector as connection
mydb=connection.connect(user="root",database="sunday",passwd="mysql",host="localhost",use_pure=True)

In [15]:
mycursor=mydb.cursor()

In [131]:
mycursor.execute("create table customers(id INT(90),cust_name VARCHAR(90),designation VARCHAR(10))")

In [132]:
mycursor.execute("create table orders(or_id INT(90),amount INT(90),cust_id INT(90))")

In [134]:
mycursor.execute("drop table if exists customer")

In [136]:
mycursor.execute("drop table if exists users")

In [8]:
l=[(1,'abc','A'),(2,'pqr','B'),(3,'mno','C')]
l1=[(601,10000,1),(602,2000,4),(603,1500,3)]

In [11]:
q1="insert into CUSTOMERS(id,cust_name,designation) values(%s,%s,%s)"
q2="insert into ORDERS(or_id,amount,cust_id) values(%s,%s,%s)"

In [16]:
mycursor.executemany(q2,l1)

In [17]:
mydb.commit()

In [18]:
#INNER JOIN-

In [40]:
query="SELECT CUSTOMERS.cust_name,ORDERS.or_id\
       FROM ORDERS\
       INNER JOIN CUSTOMERS ON CUSTOMERS.id=ORDERS.cust_id"                                       
       
#A INTERSECTION B

In [45]:
mycursor=mydb.cursor()

In [42]:
mycursor.execute(query)

In [43]:
mycursor.fetchall()

[('abc', 601), ('mno', 603)]

In [44]:
query1="SELECT CUSTOMERS.cust_name,ORDERS.or_id\
       FROM ORDERS\
       LEFT JOIN CUSTOMERS ON CUSTOMERS.id=ORDERS.cust_id"                                       
#LEFT SET-ORDERS RIGHT SET-CUSTOMERS A or (A INTERSECTION B)

In [46]:
mycursor.execute(query1)

In [47]:
mycursor.fetchall()

[('abc', 601), (None, 602), ('mno', 603)]

In [48]:
query2="SELECT CUSTOMERS.cust_name,ORDERS.or_id\
       FROM ORDERS\
       RIGHT JOIN CUSTOMERS ON CUSTOMERS.id=ORDERS.cust_id"
#B or B intersection A

In [50]:
mycursor.execute(query2)

In [51]:
mycursor.fetchall()

[('abc', 601), ('pqr', None), ('mno', 603)]

In [58]:
query3="SELECT CUSTOMERS.cust_name,ORDERS.or_id\
       FROM ORDERS\
       FULL OUTERJOIN CUSTOMERS ON CUSTOMERS.id=ORDERS.cust_id"

In [56]:
mycursor=mydb.cursor()

In [60]:
mydb.close()

In [ ]:
import